ClubRole = {
    --普通成员
    Member = 0,
    --合伙人
    Partner = 1,
    --管理员
    Admin = 2,
    --创建者
    Boss = 3
}

ClubRoleName = {
    [ClubRole.Member] = "会员",
    [ClubRole.Partner] = "队长",
    [ClubRole.Admin] = "管理员",
    [ClubRole.Boss] = "老板"
}

ClubErrorDefine = {
    [20001] = "俱乐部名称不能为空",
    [20002] = "俱乐部名称已存在",
    [20003] = "俱乐部已达上限",
    [20004] = "俱乐部不存在",
    [20005] = "权限不足",
    [20006] = "加入申请已处理",
    [20007] = "俱乐部队长已达上限",
    [20008] = "不能设置为队长",
    [20009] = "该玩家不存在",
    [20010] = "不能设为管理员",
    [20011] = "俱乐部管理员已达上限",
    [20012] = "俱乐部已达上限",
    [20013] = "玩家已经在该俱乐部",
    [20014] = "暂时无法加入游戏，请联系管理员",
    [20015] = "俱乐部已打烊",
    [20016] = "该玩家不存在",
    [20017] = "俱乐部邀请码不能为空",
    [20018] = "该玩家已经绑定",
    [20019] = "请选择两个玩家绑定",
    [20020] = "管理员不能操作老板或其他管理员",
    [20021] = "该玩家不是俱乐部成员",
    [20022] = "该玩家不存在",
    [20024] = "暂时无法加入游戏，请联系管理员",
    [20025] = "推广员不存在",
    [40023] = "加入房间失败",
    [10011] = "加入房间金币不足"
}

--大联盟成员界面每页显示数
ClubMemberCountPerPage = 10
--大联盟加入申请界面每页显示数
ClubApplyCountPerPage = 10
--大联盟桌子每页显示数据
ClubTableCountPerPage = 12
--小黑屋列表每页显示数据
ClubBlackRoomCountPerPage = 10

ClubInputNumberPanelType = {
    --加入大联盟
    JoinClub = {maxNum = 7},
    --添加合伙人
    AddPartner = {maxNum = 6},
    --添加成员
    AddMember = {maxNum = 6}
}