--帮助配置
HELP_CONFIG = {
    [1] = {
        name = "内江麻将",
        data = {
            title = "内江麻将介绍",
            describe = {
                [1] = {
                    type = 1,
                    data = {
                        exp = 
[[
一、游戏规则
　　1.游戏人数:4人。
　　2.只有筒、条,共72张牌。
　　3.支持一炮多响,即一张牌可以点炮多家。若玩家放
      一手牌未胡,则该玩家没有过手就都不能胡,加番
      也不能胡牌。过手有三种情况:
     (1)自己摸牌；(2)自己碰牌(3)自己杠牌。
      报叫后,能胡必胡。只要我这一轮有胡牌的操作项,
      不胡牌,就没有过手,只能等到我下次有新的操作
      项的时候才能胡牌。
    4.呼叫转移(杠上炮):
      如果杠牌后收了别人雨钱但杠上炮了要把收的雨钱
      转给胡的玩家,如果杠上炮点两家,另一家的雨钱
      由最先胡的人收；杠上花:收所有未胡人的钱。
    5.飘:两家以上飘输赢总分乘四,一家飘乘二,只针
      对飘了的玩家
    6.最后一张牌玩家可以杠,杠后不摸牌。(玩家不出
      牌)
    7.未及时杠:自杠若未及时杠,第二轮开始杠时依然
      算雨钱
    8.报叫:报叫后,报叫后不能碰牌
    (1)报叫后:胡加番,被胡也要加番；
    (2)两家都报叫,胡对家时,加2番。
    9.豹子(作为游戏选项):每把游戏开始掷骰子时,
      当两个骰子数子相同时,本局结算分数按*2计算。
      相应结算框也要按豹子算分显示。
   10.抢杠胡:抢的这个杠,只要杠牌的那个玩家最后没叫,
       抢杠的玩家就不会收雨钱了,只有番型钱
二、术语解释
]]
}
                },
                [2] = {
                    type = 2,
                    data = {
                        name = "庄家",
                        exp = "首先摸牌、出牌的玩家。第一局:随机。正常输赢:第一个胡的玩家一炮双响或三响:第一个胡的玩家流局:四人都有叫或四人都无叫:上局玩家三家没下叫:有叫的玩家三家都下叫:无叫的玩家两家都有叫:由系统随机在两个无叫的玩家里选一个。"
                    }
                },
                [3] = {
                    type = 2,
                    data = {
                        name = "归(相当于根)",
                        exp = "四张同样的牌都在一家的手里就叫“归”,包括杠和还在手里的牌,比如碰了3条,手里还有345条,这种也算一归。每有一归加一番。"
                    }
                },
                [4] = {
                    type = 2,
                    data = {
                        name = "报叫",
                        exp = "报叫后,当手里有三张相同牌单独成坎,则在打牌过程中能成杠,系统可提示是否杠。报杠后必须杠,但能胡时优先胡 "
                    }
                },
                [5] = {
                    type = 2,
                    data = {
                        name = "反查",
                        exp = "玩家报叫后一直没有能够胡牌,直到所有牌摸完仍有两位玩家以上,报叫玩家赔偿其他有叫的玩家,在最大牌型之上增加1番,若有玩家无叫则赔偿报叫玩家最大牌型增加1番"
                    }
                },
                [6] = {
                    type = 2,
                    data = {
                        name = "下叫",
                        exp = "当玩家只差一张牌即可胡牌时称为下叫"
                    }
                },
                [7] = {
                    type = 2,
                    data = {
                        name = "流局",
                        exp = "当所有牌被摸完后,还有2家及以上的玩家未胡牌,则该局流局,进入查叫阶段"
                    }
                },
                [8] = {
                    type = 2,
                    data = {
                        name = "查叫",
                        exp = "流局后系统检查未胡牌玩家是否都已下叫,未下叫玩家赔偿下叫玩家最大可胡牌的分数"
                    }
                },
                [9] = {
                    type = 2,
                    data = {
                        name = "查杠",
                        exp = "若有刮风下雨收入的玩家在牌局结束时都未下叫,则返还所得的刮风下雨钱。"
                    }
                },
                [10] = {
                    type = 2,
                    data = {
                        name = "一牌多用",
                        exp = "比如玩家甲打出一张五条,玩家乙可以碰(或者杠),玩家丙可以胡,玩家丁也可以胡,则三家都可以同时使用此牌。"
                    }
                },
                [11] = {
                    type = 2,
                    data = {
                        name = "暗杠",
                        exp = "自己牌里有四张同样的牌进行开杠(要翻一张牌亮给其他玩家看见)。"
                    }
                },
                [12] = {
                    type = 2,
                    data = {
                        name = "巴杠",
                        exp = "比如已经碰了3条,又摸了一张3条起来,再开杠,叫巴杠。"
                    }
                },
                [13] = {
                    type = 2,
                    data = {
                        name = "引杠",
                        exp = "比如打一张3条出去,另一家杠3条,就叫引杠。"
                    }
                },
                [14] = {
                    type = 2,
                    data = {
                        name = "抢杠",
                        exp = "巴杠、延时杠时的牌被其他人胡了。被抢杠方的归仍然有效,计一番。抢杠方加一番。雨钱:被一家抢杠,另外没胡的玩家的雨钱转给该抢杠者,被两家抢杠,先把未胡人(包括抢杠的两家)的雨钱收到,再平均分给这两家。杠上炮(暗杠和点杠后的)也一样。"
                    }
                },
                [15] = {
                    type = 2,
                    data = {
                        name = "补张",
                        exp = "开杠后从牌墙里直接按正常顺序摸一张。"
                    }
                },
                [16] = {
                    type = 1,
                    data = {
                        exp = "三、胡牌类型"
                    }
                },
                [17] = {
                    type = 3,
                    data = {
                        name = "平胡\n0番(*1)",
                        exp = "四坎牌加一对将(四坎牌可为刻子也可以是顺子,不全为刻子,不同花色)。",
                        cards = {21, 21, 21, 12, 13, 14, 24, 25, 26, 27, 28, 29, 18, 18}
                    }
                },
                [18] = {
                    type = 3,
                    data = {
                        name = "对对胡\n2番(*4)",
                        exp = "除了一对将以外,剩下的4个坎子都是刻子。",
                        cards = {11, 11, 11, 13, 13, 13, 25, 25, 25, 28, 28, 28, 12, 12}
                    }
                },
                [19] = {
                    type = 3,
                    data = {
                        name = "清一色\n2番(*4)",
                        exp = "符合平胡条件,并且所有牌为同一花色。",
                        cards = {12, 12, 13, 13, 14, 14, 14, 15, 16, 17, 18, 19, 16, 16}
                    }
                },
                [20] = {
                    type = 3,
                    data = {
                        name = "暗七对\n2番(*4)",
                        exp = "全由对子组成的牌型",
                        cards = {11, 11, 12, 12, 13, 13, 14, 14, 15, 15, 16, 16, 29, 29}
                    }
                },
                [21] = {
                    type = 3,
                    data = {
                        name = "清对(清一色+大对子)\n4番(*16)",
                        exp = "清一色的对对胡",
                        cards = {22, 22, 22, 23, 23, 23, 25, 25, 25, 26, 26, 26, 27, 27}
                    }
                },
                [22] = {
                    type = 3,
                    data = {
                        name = "双龙对(暗七对+二归)\n4番(*16)",
                        exp = "暗七对中有两对相同的牌.相当于暗七对加根.计算时不再算根加的番。",
                        cards = {12, 12, 13, 13, 13, 13, 16, 16, 23, 23, 27, 27, 28, 28}
                    }
                },
                [23] = {
                    type = 3,
                    data = {
                        name = "清七对(清一色+暗七对)\n4番(*16)",
                        exp = "清一色+七对",
                        cards = {12, 12, 13, 13, 14, 14, 16, 16, 17, 17, 18, 18, 19, 19}
                    }
                },
                [24] = {
                    type = 3,
                    data = {
                        name = "清龙对(清一色+双龙对)\n5番(*32)",
                        exp = "清一色的龙对, 相当于清七对加根.计算时不再算根加的番.",
                        cards = {11, 11, 12, 12, 13, 13, 13, 13, 16, 16, 17, 17, 18, 18}
                    }
                }
            }
        }
    },

    [2] = {
        name = "宜宾麻将",
        data = {
            title = "宜宾麻将介绍",
            describe = {
                [1] = {
                    type = 1,
                    data = {
                        exp = 
[[
一、游戏规则
    1.游戏人数:4人。  
    2.自摸胡玩法:(只能自摸才可以胡牌)玩法分自摸胡
    8听,自摸胡11听。
    3.只有筒、条、万3种,共108张牌。没有其它花色。
    4.必须要打缺(只剩下筒,条,万,其中两种)之后才能
    胡牌【听用牌除外】。
    5.飘玩法【投完骰子后出现按钮】:若玩家选择飘,
    则该玩家游戏币输赢为底分*番数*2倍,如果有两位及
    以上玩家选择飘,则玩家游戏币输赢为底分*番数*4倍.
    例:如果a飘b不飘,则a和b钱的输赢就会*2,两个都飘
    了,就*4,两个都没飘,以1倍算。
    6.听用牌:在所有玩家都摸完牌后,由系统在正常牌
    堆位置翻一张牌,这张牌为“本金”,这张牌不属于任
    何人,所以本金在游戏开始后就只有三张了；“本金”
    的上一个数字和下一个数字的牌为听用牌,
    例如:“本金”为一万,则听用牌为4张九万和4张二万,
    共八张。【以下都用这个例子】,本金加翻,例如碰了
    本金加一翻,胡牌后可以用听用组合成四张本金的可
    加两翻。除本金,胡牌后有四张相同牌可加一翻,听用
    可加入其中。11个听用的玩法,只需加上三个本金作
    为听用,就没有本金加翻这个玩法,其它规则不变。
        (1)听用牌不能打出；
        (2)飞:听用牌可代替其他牌碰牌:假如听用牌为1万,
        玩家手中有1万和九条,当另一玩家打出九条时,一
        万+九条+别人打出的九条就可以碰,称为“飞”。 
        自摸胡玩法飞牌后两番起胡,不能胡一翻,提了牌
        也要两番起胡、
        (3)听用牌只能替碰,不能替杠。假如,手里有一个
        停用两个九条,别人打一个九条来就只能选择碰,
        不能够杠,杠牌不能使用停用。
        (4)提:牌“飞”了以后,如果玩家摸到了一张九条,
        可以把一万这张听用牌替下来,称为“提”。
        (5)手里多余的听用牌能和碰牌组合成4张相同的
        牌俗称根可加一翻。
        (6)无听用牌的碰牌有优先选择权,即,若a玩家有
        两个二筒,b玩家有一听用+二筒,碰牌时,先给a玩
        家操作时间碰牌,若a玩家过,才给b玩家碰牌的操
        作时间；若是两个碰牌玩家都是听用+二筒,则按
        出牌顺序给玩家操作时间。【操作时间可调】
        (7)流局不下庄。
        (8)过水不碰(飞):未过自己手第一次放弃碰或飞
        的牌,第二次打出也不能碰或者飞。除非过了手就
        是自己摸了牌的意思
        (9)自摸加番的特殊情况:自己自摸时,如果别家是
        下叫金钩钓,则多收该玩家一番
    7.本金:在所有玩家都摸完牌后,由系统在正常牌堆位
    置翻一张牌,这张牌为“本金”,这张牌不属于任何人,
    所以本金在游戏开始后就只有三张了。
    8.听用:“本金”的前一张牌和后一张牌为听用牌,
    例如,“本金”为一万,则听用牌为4张九万和4张二万,
    共八张。
二、术语解释

]]
                    }
                },
                [2] = {
                    type = 2,
                    data = {
                        name = "庄家",
                        exp = "若新开局则随机选定庄家,以后就是哪个胡头家哪个的庄家,选择点炮胡玩法的一炮多响就为点炮者庄家,其次都是哪个胡头家哪个的庄家"
                    }
                },
                [3] = {
                    type = 2,
                    data = {
                        name = "定缺",
                        exp = "定缺模式中,需要选定3个花色的一种作为打缺的花色,选定以后不能够在更改"
                    }
                },
                [4] = {
                    type = 2,
                    data = {
                        name = "碰",
                        exp = "玩家手上有一对子,当其他玩家打出同一牌时,该玩家可以碰牌"
                    }
                },
                [5] = {
                    type = 2,
                    data = {
                        name = "下叫",
                        exp = "当玩家只差一张牌即可胡牌时称为下叫"
                    }
                },
                [6] = {
                    type = 2,
                    data = {
                        name = "流局",
                        exp = "当所有牌被摸完后,还有2家及以上的玩家未胡牌,则该局流局,进入查叫阶段"
                    }
                },
                [7] = {
                    type = 2,
                    data = {
                        name = "查叫",
                        exp = "流局后系统检查未胡牌玩家是否都已下叫,未下叫玩家赔偿下叫玩家最大可胡牌的分数"
                    }
                },
                [8] = {
                    type = 2,
                    data = {
                        name = "查花猪",
                        exp = "检查未胡牌玩家是否存在花猪现象"
                    }
                },
                [9] = {
                    type = 2,
                    data = {
                        name = "天胡",
                        exp = "开局后,庄家起手未打出任何牌即胡牌,则为天胡。"
                    }
                },
                [10] = {
                    type = 2,
                    data = {
                        name = "地胡",
                        exp = "开局后,庄家打出的第一张手牌点炮,则为地胡。"
                    }
                },
                [11] = {
                    type = 2,
                    data = {
                        name = "金钩炮",
                        exp = "当手里面的牌通过碰、杠以后,手里面只剩最后一张牌,手里面最后一张牌点炮了,胡了的那家需对金钩炮哪家加一番"
                    }
                },
                [12] = {
                    type = 2,
                    data = {
                        name = "抢杠",
                        exp = "在某个玩家选择巴杠的时候,另一个玩家正好胡这张杠牌,这时便可以视为抢杠,也可视准备杠牌的那个玩家点炮。抢杠需加胡牌的玩家一翻"
                    }
                },
                [13] = {
                    type = 2,
                    data = {
                        name = "杠上炮",
                        exp = "杠牌之后打出的哪张牌被点炮了,胡牌者多加一翻"
                    }
                },
                [14] = {
                    type = 2,
                    data = {
                        name = "甩听用",
                        exp = "在牌型能胡任意一张牌时,缺的哪方不算,不能接受别人点炮必须自摸胡"
                    }
                },
                [15] = {
                    type = 1,
                    data = {
                        exp = "三、胡牌类型"
                    }
                },
                [16] = {
                    type = 3,
                    data = {
                        name = "平胡\n有听用时1番,无听用时3番",
                        exp = "四坎牌加一对将(四坎牌可为刻子也可以是顺子,不全为刻子,不同花色)。",
                        cards = {21, 21, 21, 12, 13, 14, 24, 25, 26, 27, 28, 29, 18, 18}
                    }
                },
                [17] = {
                    type = 3,
                    data = {
                        name = "对对胡\n有听用时3番,无听用时5番",
                        exp = "除了一对将以外,剩下的4个坎子都是刻子。",
                        cards = {1, 1, 1, 3, 3, 3, 25, 25, 25, 28, 28, 28, 2, 2}
                    }
                },
                [18] = {
                    type = 3,
                    data = {
                        name = "清一色\n有听用时3番,无听用时5番",
                        exp = "符合平胡条件,并且所有牌为同一花色。",
                        cards = {12, 12, 13, 13, 14, 14, 14, 15, 16, 17, 18, 19, 16, 16}
                    }
                },
                [19] = {
                    type = 3,
                    data = {
                        name = "七对\n有听用时3番,无听用时5番",
                        exp = "玩家手牌都是对子,没有碰和刮风下雨。",
                        cards = {1, 1, 2, 2, 3, 3, 4, 4, 5, 5, 6, 6, 29, 29}
                    }
                },
                [20] = {
                    type = 3,
                    data = {
                        name = "龙七对\n有听用时4番,无听用6番",
                        exp = "玩家手牌都是对子,并且有一个根儿,没有碰和刮风下雨。",
                        cards = {12, 12, 12, 12, 13, 13, 14, 14, 15, 15, 16, 16, 27, 27}
                    }
                },
                [21] = {
                    type = 3,
                    data = {
                        name = "清一色+对对胡\n有听用6番(*32),宜宾麻将6番满",
                        exp = "清一色的对对胡。",
                        cards = {1, 1, 1, 3, 3, 3, 5, 5, 5, 8, 8, 8, 9, 9}
                    }
                },
                [22] = {
                    type = 3,
                    data = {
                        name = "清一色+暗七对\n6番(*32)宜宾麻将6番满",
                        exp = "清一色+七对",
                        cards = {12, 12, 13, 13, 14, 14, 16, 16, 17, 17, 18, 18, 19, 19}
                    }
                },
                [23] = {
                    type = 3,
                    data = {
                        name = "清一色+龙七对\n7番(*64)宜宾麻将6番满",
                        exp = "清一色的龙对, 相当于清七对加根.计算时不再算根加的番",
                        cards = {1, 1, 1, 1, 3, 3, 4, 4, 5, 5, 8, 8, 9, 9}
                    }
                },
                [25] = {
                    type = 1,
                    data = {
                        exp = "四、结算规则\n1.自摸玩家只能赢取未胡牌玩家的分数(随便哪种玩法)\n2.点炮玩家与炮胡玩家之间输赢分数\n3.匹配场积分计算:积分数 = 底分 * (2^番数)\n"
                    }
                }
            }
        }
    },

}
