UnionRole = {
    --盟主
    Leader = 0,
    --管理员
    Admin = 1,
    --合伙人
    Partner = 2,
    --普通成员
    Common = 3,
    --观察员
    Observer = 4
}

UnionRoleName = {
    [UnionRole.Leader] = "馆主",
    [UnionRole.Admin] = "管理",
    [UnionRole.Partner] = "队长",
    [UnionRole.Common] = "会员",
    [UnionRole.Observer] = "观察员",
}

UnionErrorDefine = {
    [10005] = "人员已满，不能加入房间",
    [10011] = "积分不足，不能加入房间",
    [10022] = "最后三局不可中途加入",
    [18001] = "指定用户不存在",
    [40001] = "茶馆已经存在",
    [40002] = "加入的茶馆过多",
    [40003] = "已经有默认茶馆",
    [40004] = "玩家不存在",
    [40005] = "专属码不存在",
    [40006] = "申请过该茶馆",
    [40007] = "已经是该茶馆成员",
    [40008] = "生成专属码错误，稍后再试",
    [40009] = "专属码已经失效",
    [40010] = "茶馆不存在",
    [40011] = "不是该茶馆成员",
    [40012] = "权限不足",
    [40013] = "桌子已满",
    [40014] = "桌子不存在",
    [40015] = "该玩家不是管理员",
    [40016] = "该玩家不是普通成员",
    [40017] = "没有上级玩家",
    [40018] = "没有申请记录",
    [40019] = "没有该队长信息",
    [40020] = "不能设置为队长",
    [40021] = " 没有该队长",
    [40022] = "该桌子已满",
    [40023] = "加入桌子失败",
    [40024] = "您被冻结",
    [40025] = "茶馆已经打烊",
    [40026] = "桌子有人，不能修改规则",
    [40033] = "超过自身最大可调比例",
    [40034] = "超过最低比例调整",
    [40035] = "游戏中不能修改积分",
    [40036] = "不是你的下属玩家不能修改积分",
    [40037] = "你的积分不够不能调整下属玩家的积分",
    [40038] = "下属玩家的积分不够不能调整",
    [40039] = "隔离区关系组错误",
    [40040] = "只能设置自己下级队长分数",
    [40041] = "加入桌子失败，分数未达到警戒线",
    [40042] = "队长层级过深",
    [40043] = "该玩家还拥有积分",
    [20026] = "牌局已经开始，不能踢人！",
    [10023] = "未开启GPS不能加入房间",
    [40045] = "请求数据错误",
    [40046] = "玩家被冻结不能操作",
    [40047] = "玩家ID输入有误",
    [40048] = "玩家ID不存在",
    [40049] = "该玩家不是观察员",
    [40050] = "当天的表情已领，请不要重复领取。",
    [40051] = "茶馆表情领取错误。",
    [40052] = "只能领取昨日和前日茶馆表情或保底。",
    [40053] = "管理员不能踢有分的玩家（战队）。",
    [40054] = "被追踪的玩家不在茶馆",
    [40055] = "被追踪的玩家不在游戏中",
    [40056] = "玩家被禁止进入该游戏",
    [50012] = "联盟或队长公告字数超限制",
}

--大茶馆成员界面每页显示数
UnionMemberCountPerPage = 10
--大茶馆加入申请界面每页显示数
UnionApplyCountPerPage = 10
--大茶馆桌子每页显示数据，必须为列或行的倍数
UnionTableCountPerPage = 8

UnionInputNumberPanelType = {
    --加入大茶馆
    JoinUnion = 1,
    --添加合伙人
    AddPartner = 2,
    --添加成员
    AddMember = 3
}